---
kind: property
id: P:Autodesk.Revit.DB.Lighting.SpotLightDistribution.SpotFieldAngle
source: html/c1a048db-dc4e-3645-25c5-93378a32a3bc.htm
---
# Autodesk.Revit.DB.Lighting.SpotLightDistribution.SpotFieldAngle Property

The spot field angle.

## Syntax (C#)
```csharp
public double SpotFieldAngle { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The angle is not valid because it is not between 1.0e-2 and 160.0.